Repository: TECLIB/gitflow-doc
Catalog: source/locale/*/LC_MESSAGES/features.po
Languages: fr

source: Be carefull your ``develop`` branch is up-to-date before starting or finishing a feature! Even if you can quite easily fix that ;)
fr: Prenez garde à ce que votre branche ``develop`` soit bien à jour avant de créer ou de terminer une feature ! Même si ça peut se corriger assez facilement ;)

source: This possibility will be used to implement new features in the project. Features are designed to be created from the ``develop`` branch, and reintegrated in the ``develop`` branch as well.
fr: Cette possibilité sera utilisée pour implémenter de nouvelles fonctionnalités dans le projet. Les features sont prévues pour être créées depuis la branche ``develop`` et pour être réintégrées dans la branche ``develop`` également.

source: You can have as many features as you want on a project; you'll see at usage than working with too many features can be a kind of nightmare; as well as long running ones ;)
fr: Vous pouvez avoir autant de feature que vous le souhaitez sur un projet ; mais vous vous apercevrez à l'usage que de travailler avec de trop nombreuses features peut rapidement devenir cauchemardesque, tout comme en maintenir trop longtemps ;)

source: Creation
fr: Création

source: The name of the feature is up to you, choose something simple and short, describing what you are doing. To start a feature named `my-great-feature` you'll use:
fr: Le nom de la feature est à votre entière appréciation, choisissez quelque chose de simple et court, qui décrit ce que vous allez faire. Pour créer une feature nommée ``my-great-feature``, vous entrerez :

source: This will automatically do the following:
fr: Ce qui réalisera automatiquement les tâches suivantes :

source: create a new branch named ``feature/my-great-feature`` from the ``develop`` branch,
fr: créer une nouvelle branche ``feature/my-great-feature`` depuis la branche ``develop``,

source: checkout the ``feature/my-great-feature`` branch.
fr: effecturea un checkout de la branche ``feature/my-great-feature``.

source: So, yes, you're ready to go! Just hack, commit, push, ... You're on a branch, you can do what you want (well... almost!).
fr: Donc, oui, vous êtes parés à travailler ! Codez, commitez, poussez, ... Vous êtes sur une branche, vous pouvez faire ce que vous voulez (ou presque !).

source: As stated in :ref:`working_with_github`, you will use your fork to push new branches. You'll achieve that running:
fr: Comme décrit dans :ref:`working_with_github`, vous utiliserez votre fork lors de l'ajout de nouvelles branches. Vous y parviendrez en lançant :

source: Lifetime
fr: Cycle de vie

source: Sometimes, nothing happened on the ``develop`` branch until you finish your feature, and you'll have nothing to take care of.
fr: Parfois, il ne s'est rien passé sur la branche ``develop`` avant que vous n'ayez terminé votre feature, vous n'aurez dans ce cas à vous soucier de rien.

source: But sometimes, some other features have been added, or some bugs have been fixed... You'll have to keep you feature branch up-to-date. Considering your ``develop`` branch has been updated (you always keep your ``develop`` updated, don't you? :p):
fr: Mais parfois, il est possible que d'autres features aient été ajoutées, ou que des bogues aient été corrigés... Vous devrez donc maintenir votre branche feature à jour. En considérant que votre branche ``develop`` soit à jour (mais vous maintenez toujours votre branche ``develop`` à jour, n'est-ce pas ? :p) :

source: This will rebase you feature branch on top of the develop; it sounds just like you've just created your feature right now and it applies your commit one by one on the top. Explaining rebasing is out of the scope of the current documentation, but you'll find many resources on it.
fr: Cela va rebaser votre branche feature par dessus le develop; comme si vous veniez juste de la créer. Vos commits seront appliqués un à un par dessus. Expliquer le fonctionnement du rebase est hors de la portée de la présente documentation, mais vous pourrez trouver de nombreuses ressources là-dessus.

source: Your feature has been finished, it must now be reviewed before being merged. Push last changes to your fork, go to your github fork page, select your branch and clik "New pull request" button.
fr: Votre feature est terminée, elle doit maintenant être revue avant de pouvoir être mergée. Poussez les modifications sur votre fork, allez sur sa page, sélectionnez votre branche et cliquez sur le bouton "New pull request".

source: You can provide aditionnal details if any, submit, and wait for another developer to review your changes! Once accepted, go back to your local copy, and see the paragraph below.
fr: Vous pouvez fournir des détails complémentaires au besoin, soumettre, et enfin attendre qu'un autre développeur effectue la revue de vos changements ! Une fois acceptée, retournez sur votre copie de travail, et suivez les instructions du paragraphe ci-dessous.

source: Finishing
fr: Finalisation

source: Once you're done, and your PR has been accepted, you can clean up a bit your branch history, squashing your commits to prevent keeping commit messages like "oops, I did it again!". Assuming your working copy is on the feature branch, you'll then run:
fr: Une fois terminé, et votre PR acceptée, vous pourrez nettoyer un peu l'historique de votre branche, regrouper vos commit pour éviter de conserver des messages de commit du type « Oups, j'ai oublié... ». En admettant que votre copie de travail soit sur la branche de votre feature, lancez :

source: This will do the following:
fr: Ce qui réalisera les tâches suivantes :

source: merge branch ``feature/my-great-feature`` into ``develop``,
fr: merge de la branche ``feature/my-great-feature`` dans ``develop``,

source: ask you for a commit message (default will be "Merge branch 'feature/my-great-feature' into develop")
fr: vous demandera un message de commit (qui sera par défaut "Merge branch 'feature/my-great-feature' into develop")

source: delete branch ``feature/my-great-feature``
fr: supprimera la branche ``feature/my-great-feature``

source: For the the second step, you can just save the message as it; if you've squashed your commits, you can remove the merge commit simply using:
fr: Pour la seconde étape, vous pouvez juste laisser le message tel que ; si vous avez regroupé vos commits, vous pourrez le supprimer simplement en utilisant :

source: Or not, :ref:`it's up to you <merge-vs-rebase>` :)
fr: Ou pas, :ref:`à vous de voir <merge-vs-rebase>` :)

source: Finally, push the ``develop`` branch for remote repository to be updated! And then you're done, the `my-great-feature` has reached ``develop`` and will be part of the next release! Congratulations \o/
fr: Pour terminer, poussez la branche ``develop`` pour que le dépôt distant soit à jour ! Et c'est terminé, `my-great-feature` a été réintégrée dans ``develop`` et fera partie de la prochaine release ! Félicitations \o/

source: Do not forget to remove remote ``feature/my-great-feature`` branch:
fr: N'oubliez pas de supprimer la branche ``feature/my-great-feature`` distante :
