Repository: TECLIB/gitflow-doc
Catalog: source/locale/*/LC_MESSAGES/hotfix.po
Languages: fr

source: Be carefull your ``master`` branch is up-to-date before starting a `hotfix`, and both your ``master`` and ``develop`` branches are up-to-date before finishing it!
fr: Prenez garde à ce que votre branche ``master`` soit bien à jour avant de créer un `hotfix`, et que vos branche ``master`` et ``develop`` soient toutes deux à jour avant de le terminer !

source: You will use `hotfix` to fix bugs against the latest stable release of the project, no matter it was a *major, a *minor* or another *patch*.
fr: Vous utilisez un ``hotifx`` pour corriger des bogues dans la dernière version stable du projet, peu importe qu'il s'agisse d'une version *majeure*, *mineure* ou *patch*.

source: You can have **only one** `hotfix` at the same time!
fr: Vous ne pouvez créer **qu'un seul** `hotfix` à la fois !

source: Creation
fr: Création

source: The name of the hotfix must be the release it will become. If the latest release was `1.3.2`; you'll want to create a `1.3.3` hotfix using:
fr: Le nom du hotfix doit être la version qu'il va devenir. Si la dernière version était `1.3.2` ; vous créerez un hotfix `1.3.3` en utilisant :

source: This will automatically do the following:
fr: Ce qui réalisera automatiquement les tâches suivantes :

source: create a new branch named ``hotfix/1.3.3`` from the ``master`` branch,
fr: création d'une nouvelle branche nommée ``hotfix/1.3.3`` depuis la branche ``master``,

source: checkout the ``hotfix/1.3.3`` branch.
fr: récupération (``checkout``) de la branche ``hotfix/1.3.3``

source: Lifetime
fr: Cycle de vie

source: Just like :doc:`features`, you will have nothing to do if there were no changes on the ``master`` branch since you've created your `hotfix`.
fr: Tout comme les :doc:`features`, vous n'aurez rien à faire si aucun changement n'est intervenu sur la branche ``master`` depuis que vous avez créé votre `hotfix`.

source: If something has changed in the ``master``, that means another `hotfix` has already been done, which also means that the version you are using is probably incorrect now. In that case, you will have to:
fr: Si quelque chose a changé dans le ``master``, cela signifie qu'un autre `hotfix` a été réintégré, et cela signifie également que la version que vous utilisez est probablement incorrecte maintenant. Dans ce cas, vous devrez :

source: rename your `hotfix` branch,
fr: renommer votre branche `hotfix`

source: update the code
fr: mettre le code à jour

source: Assuming the `1.3.3` version has been released from another `hotfix`, you will work on the `1.3.4` version:
fr: En partant du principe que la version `1.3.3` a été publiée depuis un autre `hotfix`, vous travaillerez sur la version `1.3.4` :

source: Your `hotfix` has been finished, it must now be reviewed before being merged. Push last changes to your fork, go to your github fork page, select your branch and clik "New pull request" button.
fr: Votre `hotfix` est terminé, il doit maintenant être revu avant de pouvoir être mergé. Poussez les modifications sur votre fork, allez sur sa page, sélectionnez votre branche et cliquez sur le bouton "new pull request".

source: You can provide aditionnal details if any, submit, and wait for another developer to review your changes! Once accepted, go back to your local copy, and see the paragraph below.
fr: Vous pouvez fournir des détails complémentaires au besoin, soumettre, et enfin attendre qu'un autre développeur effectue la revue de vos changements ! Une fois acceptée, retournez sur votre copie de travail, et suivez les instructions du paragraphe ci-dessous.

source: Finishing
fr: Finalisation

source: Before running the commands to end your `hotfix`, make sure that:
fr: Avant de lancer les commandes pour terminer votre `hotfix`, assurez-vous que :

source: your ``master`` branch is up-to-date
fr: votre branche ``master`` soit à jour

source: no other `hotfix` using the same version number has been merged (use ``git tag | sort -V``)
fr: aucun autre `hotfix` utilisant la même version n'ait été mergé (utilisez ``git tag | sort -V``)

source: You **have to use Git command line, and not Github facilities** to finish the hotfix!
fr: Vous **devez utiliser Git en ligne de commande, et non les possibilités de Github** pour terminer le hotfix !

source: Finishing a `hotfix` is as simple as:
fr: Terminer un `hotifx` est aussi simple que :

source: This will:
fr: Cale va :

source: Merge changes into the ``master`` branch,
fr: Merger les changements dans la branche ``master``,

source: Create a ``1.3.4`` tag,
fr: Créer un tag ``1.3.4``,

source: Merge changes into the ``develop`` branch,
fr: Merger les changements dans la branche ``develop``,

source: Remove your local ``hotfix\1.3.4`` branch.
fr: Supprimer votre branche ``hotfix/1.3.4`` locale.

source: Once your `hotfix` has been finished; you'll have to push ``master``, ``develop`` and ``tags`` and also remove remote ``hotfix/1.3.4`` branch:
fr: Une fois que votre `hotfix` est terminé ; vous devrez pousser ``master``, ``develop`` ainsi que les ``tags``, et aussi supprimer la branche ``hotfix/1.3.4`` distante :
