Repository: TECLIB/gitflow-doc
Catalog: source/locale/*/LC_MESSAGES/references.po
Languages: fr

source: References
fr: Références

source: A few references and links relative to git-flow.
fr: Quelques références et liens sur git-flow.

source: `model explained <http://nvie.com/posts/a-successful-git-branching-model/>`_ (original author)
fr: `explication du modèle <http://nvie.com/posts/a-successful-git-branching-model/>`_ (auteur original)

source: `git extension <https://github.com/nvie/gitflow>` (original author)
fr: `extension git <https://github.com/nvie/gitflow>` (auteur original)

source: `a quick tutorial <http://jeffkreeftmeijer.com/2010/why-arent-you-using-git-flow/>`_
fr: `un petit tutoriel <http://jeffkreeftmeijer.com/2010/why-arent-you-using-git-flow/>`_

source: `another tutorial, by Atlassian <https://www.atlassian.com/git/tutorials/comparing-workflows/gitflow-workflow>`_
fr: `un autre tutoriel, par Atlassian <https://www.atlassian.com/git/tutorials/comparing-workflows/gitflow-workflow>`_

source: `a cheat sheet <http://danielkummer.github.io/git-flow-cheatsheet/index.fr_FR.html>`_
fr: `un cheat sheet <http://danielkummer.github.io/git-flow-cheatsheet/index.fr_FR.html>`_

source: `a french video tutorial <https://www.grafikart.fr/formations/git/git-flow>`_
fr: `un tutoriel vidéo en français <https://www.grafikart.fr/formations/git/git-flow>`_

source: `stack overflow questions <http://stackoverflow.com/questions/tagged/git-flow>`_
fr: `questions stack overflow <http://stackoverflow.com/questions/tagged/git-flow>`_

source: Some links about git itself:
fr: Quelques liens à propos de Git lui-même :

source: `official website <https://git-scm.com/>`_
fr: `site web officiel <https://git-scm.com/>`_

source: `the ProGit book <https://git-scm.com/book>`_ you can view online or download for free; and that has also been printed
fr: `le livre ProGit <https://git-scm.com/book>`_ visible en ligne ou téléchargeable&nbsp;; il a également été imprimé

source: `Atlassian tutorials <https://www.atlassian.com/git/tutorials/learn-git-with-bitbucket-cloud>`_
fr: `tutoriels Atlassian <https://www.atlassian.com/git/tutorials/learn-git-with-bitbucket-cloud>`_

source: `an interactive cheat sheet <http://ndpsoftware.com/git-cheatsheet.html>`_ (I find this one really usefull to understand all interactions and "levels"
fr: `un cheat sheet interactif <http://ndpsoftware.com/git-cheatsheet.html>`_ que je trouve particulièrement intéressant pour comprendre les interactions et les différents niveaux

source: `a Stanford publication <http://www-cs-students.stanford.edu/~blynn/gitmagic/>`_ with several translations
fr: `une publication Stanford <http://www-cs-students.stanford.edu/~blynn/gitmagic/>`_ avec plusieurs traductions

source: Tools
fr: Outils

source: Well, I do use `vim <http://www.vim.org/>`_ to code, and the `git extension <https://github.com/nvie/gitflow>`_ to manage my worflow; even if some vim plugins exists; I do not use them.
fr: J'utilise `vim <http://www.vim.org/>`_ pour coder, et `l'extension git <https://github.com/nvie/gitflow>`_ pour gérer mon git-flow&nbsp;; et bien que des plugins spécifiques existent, je ne les utilise pas personnellement.

source: Anyways, if you use a tool that implements git-flow natively or with a plugin; feel free to open a PR on the current doc!
fr: Dans tous les cas, si vous utilisez un outil qui implémente git-flow nativement ou via un plugin, n'hésitez pas à ouvrir une PR sur cette documentation !
