Repository: TECLIB/gitflow-doc
Catalog: source/locale/*/LC_MESSAGES/releases.po
Languages: fr

source: Be carefull your ``develop`` branch is up-to-date before starting a release, and both your ``master`` and ``develop`` branches are up-to-date before finishing it!
fr: Prenez garde à ce que votre branche ``develop`` soit bien à jour avant de créer une `release`, et que vos branche ``master`` et ``develop`` soient toutes deux à jour avant de la terminer !

source: You will use the release feature to publish new *minor* or *major* versions, but not *patches*. It is designed to begin a new fresh release from the ``develop`` branch.
fr: Vous aurez recours à la fonctionnalité `release` pour publier de nouvelles versions *mineures* ou *majeures*, mais pas pour les *patches*. Ceci est prévu pour publier de nouvelles versions depuis la branche ``develop``.

source: You can have several releases on a project; but honestly, I cannot find a use case where it should really be used. It's up to you ;)
fr: Vous pouvez avoir plusieurs `release` sur un même projet, mais en toute honnêteté, je ne parviens pas à trouver une cas de figure où ce serait réellement utile. À vous de voir ;)

source: Creation
fr: Création

source: Just as :doc:`hotfixes <hotfix>`, the branch name must be the version it will become. Let's say we want to release a new *minor* ``1.4.0``:
fr: Tout comme pour les :doc:`hotfix <hotfix>`, le nom de la branche doit être la version qu'elle va devenir. Partons du principe que vous vsouhaitez publier une nouvelle version *mineure* ``1.4.0`` :

source: This will automatically do the following:
fr: Ce qui réalisera automatiquement les tâches suivantes :

source: create a new branch named ``release/1.4.0`` from the ``develop`` branch,
fr: création d'une nouvelle branche nommée ``release/1.4.0`` depuis la branche ``develop``,

source: checkout the ``release/1.4.0`` branch.
fr: récupération (``checkout``) de la branche ``release/1.4.0``

source: Lifetime
fr: Cycle de vie

source: Until it's finished, you can still add new :doc:`hotfixes <hotfix>` or :doc:`features <features>` (anyways, if a new feature must reach your release, you've a planning issue ;)).
fr: Jusqu'à ce que ce soit terminé, vous pouvez toujours ajouter de nouveaux :doc:`hotfix <hotfix>` ou :doc:`features <features>` (dans tous les cas, si une nouvelle `feature` doit être ajoutée à votre `release`, vous avez probablement un souci de planning ;)).

source: But keep in mind **nothing will not reach your release branch until you do something!**.
fr: Mais gardez à l'esprit que **rien ne sera ajouté à votre branche release sans que vous l'ayez fait vous-même !**

source: Most of the time, your release branch should have a quite short lifetime; and changes should be very light comparing your ``develop``. As an example, on several project I own (or I've owned); the `release` branch was created to update the changelog if any, add the release date, and eventually bump the version.
fr: La plupart du temps, votre branche `release` aura une durée de vie relativement courte ; les modifications seront généralement limitées par rapport à votre ``develop``. Par exemple, sur plusieurs projets que je maintiens (ou que j'ai maintenu), une branche `release` n'est créée que pour mettre à jour le changelog, ajouter la date de publication, et éventuellement mettre à jour la version.

source: This kind of branch may be used for testing purposes also.
fr: Ce type de branche peut être utilisé pour tester également.

source: Sometimes, you can also just create a `release` to finish it immediately without doing any changes... :-)
fr: Parfois, vous pourrez également créer une `release` pour la terminer immédiatement sans effectuer de modifications… :-)

source: If a new `hotfix` has been added, than you'll have to get it back to your release branch. To know how to proceed, you'll have to determine if something else has changed; because you probably do not want a feature finished after you decide to release to be backported.
fr: Si un nouveau `hotifx` a été ajouté, vous devrez l'incorporer à votre branche `release`. Pour savoir comment procéder, vous devrez tout d'abord déterminer si quelque chose d'autre a changé, vous ne souhaiterez probablement pas qu'une `feature` terminée après que vous ayez décidé de publier ne soit récupérée.

source: Remember that you should always prefer to merge or cherry pick rather than report changes manually; that would cause conflicts while finishing.
fr: Souvenez-vous qu'il est toujours préférable de merge et de faire un cherry-pick plutôt que de reporter des modifications manuellement ; ceci pour éviter des conflits ultérieurs lors de la finalisation.

source: In the simpliest case, nothing else has changed in your ``develop``, just update it and run:
fr: Dans le cas le plus simple, rien n'a changé dans le ``develop``, mettez juste à jour et lancez :

source: If there were other changes, it may be a bit more complex. You can either ``cherry-pick`` the fix commit, or use advanced git possibilities of ``merge`` command (such as merging a specific range of commits, for example); refer to the :ref:`Git documentation <gitdoc>`.
fr: S'il y a eu d'autres changements, cela peut s'avérer un peu plus complexe. Vous pouvez soit ``cherry-pick`` le commit correctif, ou encore utiliser les possibilités avancée de ``merge`` (comme récupérer une plage de commits, par exemple) ; référez-vous à la :ref:`documentation Git <gitdoc>`

source: Pul request
fr: Pull Request

source: If' you've just created the `release` to bump the version, it is not mandatory to open a pull request. On the other hand, if you've made fixes, you'll have to.
fr: Si vous avez créé une `release` pour juste mettre à jour le numéro de version, il ne sera pas nécessaire d'ouvrir une pull request. D'un autre côté, si vous avez effectué des corrections, vous devrez en passer par là.

source: If you're on the second use case, push last changes to your fork, go to your github fork page, select your branch and clik "New pull request" button.
fr: Si vous vous trouvez dans le second cas de figure, poussez le derniers changements sur votre fork, allez sur votre page github, sélectionnez votre branche et cliquez sur le bouton "New pull request".

source: You can provide aditionnal details if any, submit, and wait for another developer to review your changes!
fr: Vous pouvez fournir des détails complémentaires au besoin, soumettre, et enfin attendre qu'un autre développeur effectue la revue de vos changements !

source: Once accepted, or if you do not need a PR, go back to your local copy, and see the paragraph below.
fr: Une fois acceptée, ou si vous n'avez pas besoin de passer par une pull request, retournez sur votre copie de travail, et suivez les instructions du paragraphe ci-dessous.

source: Finishing
fr: Finalisation

source: Before running the commands to end your `release`, make sure that:
fr: Avant de lancer les commandes pour terminer votre `release`, assurez-vous que :

source: your ``master`` and ``develop`` branches are up-to-date
fr: vos branches ``master`` et ``develop`` soient à jour

source: no other tag using the same version number has been created (use ``git tag | sort -V``)
fr: aucun autre tag utilisant la même version n'ait été créé (utilisez ``git tag | sort -V``)

source: You **have to use Git command line, and not Github facilities** to finish the release!
fr: Vous **devez utiliser Git en ligne de commande, et non les possibilités de Github** pour terminer la release !

source: Finishing a `release` is as simple as:
fr: Terminer une `release` est aussi simple que :

source: This will:
fr: Cela va :

source: Merge changes into the ``master`` branch,
fr: Merger les changements dans la branche ``master``,

source: Create a ``1.4.0`` tag,
fr: Créer un tag ``1.4.0``,

source: Merge changes into the ``develop`` branch,
fr: Merger les changements dans la branche ``develop``,

source: Remove your local ``release\1.4.0`` branch.
fr: Supprimer votre branche ``release/1.4.0`` locale.

source: Once your `release` has been finished; you'll have to push ``master``, ``develop`` and ``tags`` and also remove remote ``release/1.4.0`` branch (if any):
fr: Une fois que votre `release` est terminée, vous devrez pousser ``master``, ``develop`` ainsi que les ``tags`` ; et aussi supprimer la branche distante ``release/1.4.0`` (si toutefois elle existe) :
